In [1]:
# imports
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

pd.set_option('display.max_columns',100)

import warnings 
# Setting the warnings to be ignored 
warnings.filterwarnings('ignore')

In [2]:
# Creating database connection
connec_str = "mysql+pymysql://root:root@localhost/Movies"
engine = create_engine(connec_str)
create_database(connec_str)

In [3]:
# Checking if database has been created
if database_exists(connec_str) == False:
  create_database(connec_str)
  print("The database has been created successfully!")
else:
  print('The database already exists!')

The database already exists!

loading in files

In [4]:
df1 = pd.read_csv("Data/title_basics_combined.csv.gz")
df1.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008.0,NaN,94,Horror

In [5]:
# CReating a column for list of genres
df1["genres_split"] = df1["genres"].str.split(",")
df1

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008.0,NaN,94,Horror,[Horror]
...,...,...,...,...,...,...,...,...,...,...
139229,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
139230,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020.0,NaN,84,Thriller,[Thriller]
139231,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"
139232,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019.0,NaN,123,Drama,[Drama]
139233,tt9916730,movie,6 Gunn,6 Gunn,0,2017.0,NaN,116,Drama,[Drama]

In [6]:
# Creating a row for every genre per movie
exploded_genres = df1.explode("genres_split")
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
139230,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020.0,NaN,84,Thriller,Thriller
139231,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
139231,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History
139232,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019.0,NaN,123,Drama,Drama
139233,tt9916730,movie,6 Gunn,6 Gunn,0,2017.0,NaN,116,Drama,Drama

In [7]:
# Getting a list of unique genres
unique_genres = sorted(exploded_genres["genres_split"].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [8]:
# Create a new title_genres table
title_genres = exploded_genres[["tconst","genres_split"]].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

In [9]:
# Creeating the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [10]:
# make new integer genre_id and drop string genres
title_genres["genre_id"] = title_genres["genres_split"].map(genre_map)
title_genres = title_genres.drop(columns="genres_split")
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0068865         7

In [11]:
# Converting the genre map dictionary into a dataframe.
genres = pd.DataFrame({"genre_name": genre_map.keys(),
                        "genre_id":genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [12]:
# Dropping unwanted columns in title_basics
title_basics = df1.drop(columns=['originalTitle','isAdult','titleType','genres','genres_split','endYear'])
title_basics

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0068865,Lives of Performers,2016.0,90
3,tt0069049,The Other Side of the Wind,2018.0,122
4,tt0082328,Embodiment of Evil,2008.0,94
...,...,...,...,...
139229,tt9916190,Safeguard,2020.0,95
139230,tt9916270,Il talento del calabrone,2020.0,84
139231,tt9916362,Coven,2020.0,92
139232,tt9916538,Kuambil Lagi Hatiku,2019.0,123
139233,tt9916730,6 Gunn,2017.0,116

In [13]:
df2 = pd.read_csv("Data/title_ratings_combined.csv.gz")
df2.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000003            6.5      1894
3  tt0000004            5.5       178
4  tt0000005            6.2      2677

In [14]:
df3 = pd.read_csv("Data/tmdb_results_combined.csv.gz")
df3.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,Two rural teens sing and dance their way throu...,2.983,/hfO64mXz3DgUxkBVU7no2UWRP7x.jpg,"[{'id': 51207, 'logo_path': None, 'name': 'Sul...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-09-22,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
1,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,Two neighbors become intimate after discoverin...,34.815,/iYypPT4bhqXfq1b6EnmxvRt6b2Y.jpg,"[{'id': 539, 'logo_path': '/iPLtePguIzOPNtAWfT...","[{'iso_3166_1': 'FR', 'name': 'France'}, {'iso...",2000-09-29,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.106,2364.0,PG
2,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,Upon discovery of a shard of what could be the...,16.614,/mzOgKYOXiuwE5DIfagFs34bOb3J.jpg,"[{'id': 2216, 'logo_path': None, 'name': 'Helk...","[{'iso_3166_1': 'CA', 'name': 'Canada'}, {'iso...",2000-04-19,0.0,88.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,not to survive the fight in the external world...,Heavy Metal 2000,0.0,6.078,193.0,R
3,tt0120202,0.0,/tuerGhZ1lA8wpBjUCEUpeTWDT5B.jpg,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",http://www.newline.com/properties/stateandmain...,21991.0,en,State and Main,A movie crew invades a small town whose reside...,10.297,/o2iv0pbO3ou9y6LvCIPUX9VT2me.jpg,"[{'id': 8, 'logo_path': '/78ilmDNTpdCfsakrsLqm...","[{'iso_3166_1': 'FR', 'name': 'France'}, {'iso...",2000-08-26,9206279.0,106.0,"[{'english_name': 'Italian', 'iso_639_1': 'it'...",Released,Big movie. Small town. Huge trouble.,State and Main,0.0,6.318,184.0,NaN
4,tt0120263,0.0,/ynXVuylP8upazjz8lrqb1PEMkdR.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...",NaN,34070.0,sv,Sånger från andra våningen,A monumental traffic jam serves as the backdro...,7.123,/heW06kNneH6nL59h4ZoaODYXFmY.jpg,"[{'id': 157, 'logo_path': '/s537keIoi6wUOU8E9z...","[{'iso_3166_1': 'SE', 'name': 'Sweden'}, {'iso...",2000-10-06,80334.0,99.0,"[{'english_name': 'Russian', 'iso_639_1': 'ru'...",Released,NaN,Songs from the Second Floor,0.0,7.200,249.0,NaN

In [15]:
# Keeping wanted columns only for api results
tmdb_data = df3[["imdb_id","budget","revenue","certification"]]
tmdb_data.head()

     imdb_id      budget     revenue certification
0  tt0113026  10000000.0         0.0           NaN
1  tt0118694    150000.0  14204632.0            PG
2  tt0119273  15000000.0         0.0             R
3  tt0120202         0.0   9206279.0           NaN
4  tt0120263         0.0     80334.0           NaN

In [16]:
# displaying tables to be added to database with their datatypes

In [17]:
title_basics.dtypes

tconst             object
primaryTitle       object
startYear         float64
runtimeMinutes      int64
dtype: object

In [18]:
title_ratings = df2
title_ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [19]:
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [20]:
genres.dtypes

genre_name    object
genre_id       int64
dtype: object

In [21]:
tmdb_data.dtypes

imdb_id           object
budget           float64
revenue          float64
certification     object
dtype: object

In [22]:
# Creating schema dictionaries
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()
}

title_ratings_schema = {
    "tconst" : String(key_len+1),
    "averageRating" : Float(),
    "numVotes" : Integer()
}

key_lentmdb = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_lentmdb = tmdb_data['certification'].fillna('').map(len).max()
tmdb_data_schema = {
    "imdb_id": String(key_lentmdb+1), 
    "certification": Text(cert_lentmdb+1),
    'revenue':Float(),
    'budget':Float()
}

In [23]:
# Save to sql with dtype and index=False
title_basics.to_sql('title_basics',engine,dtype=title_basics_schema,if_exists='replace',index=False)
title_ratings.to_sql('title_ratings',engine,dtype=title_ratings_schema ,if_exists='replace',index=False)
title_genres.set_index('genre_id').to_sql('title_genres',engine,if_exists='replace',index=True)
genres.set_index('genre_id').to_sql('genres',engine,if_exists='replace',index=True)
tmdb_data.to_sql('tmdb_data',engine,dtype=tmdb_data_schema,if_exists='replace',index=False)

756

In [24]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [25]:
# displaying first 5 rows of each table.
q1 = """SELECT *
FROM title_basics
LIMIT 5;"""
pd.read_sql(q1, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0068865,Lives of Performers,2016.0,90
3,tt0069049,The Other Side of the Wind,2018.0,122
4,tt0082328,Embodiment of Evil,2008.0,94

In [26]:
q2 = """SELECT *
FROM title_ratings
LIMIT 5;"""
pd.read_sql(q2, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000003            6.5      1894
3  tt0000004            5.5       178
4  tt0000005            6.2      2677

In [27]:
q3 = """SELECT *
FROM title_genres
LIMIT 5;"""
pd.read_sql(q3, engine)

   genre_id     tconst
0         5  tt0035423
1         9  tt0035423
2        18  tt0035423
3         7  tt0062336
4         7  tt0068865

In [28]:
q4 = """SELECT *
FROM genres
LIMIT 5;"""
pd.read_sql(q4, engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [29]:
q5 = """SELECT *
FROM tmdb_data
LIMIT 5;"""
pd.read_sql(q5, engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0113026  10000000.0         0.0          None
2  tt0118589  22000000.0   5271670.0         PG-13
3  tt0118652   1000000.0         0.0             R
4  tt0118694    150000.0  14204600.0            PG